package com;

/**
 * Created by RUSLAN77 on  24.10.2016 in Ukraine  Использование расширенного цикла for для обработки двумерного массива
 */
public class ForEach2 {
    public static void main(String[] args) {
        int sum = 0;
        int nums[][] = new int[3][5];
        // Ввести ряд значений в массив nums
        for (int i = 0; i < 3; i++)
            for (int j = 0; j < 5; j++)
                nums[i][j] = (i + 1) * (j + 1);

        //Использовать разновидность for-each цикла for для суммирования и отображения значений:

          /*Заметьте, каким образом объявлена переменная х. Она представляет собой ссылку на одномерный целочисленный массив. Это очень важно,
          поскольку на каждом шаге цикла for из двумерного массива nums извлекается очередной массив, начиная с nums [ О J.
          А во внутреннем цикле for перебираются элементы полученного массива и отображаются их значения.*/
        for (int x[] : nums) {
            for (int y : x) {
                System.out.println("Значение: "+y);
                sum+=y;
            }
        }
        System.out.println("Сумма: "+ sum);
    }
}


